Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/ADC14_356.0.xml
<module id="ADC14" HW_revision="356.0">
    <register id="ADC14CTL0" width="32" offset="0x0" internal="0" description="Control 0 Register">
        <bitfield id="ADC14SC" description="ADC14 start conversion" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ADC14SC_0" value="0x0" description="No sample-and-conversion-start"/>
            <bitenum id="START" value="0x1" description="Start sample-and-conversion"/>
        </bitfield>
        <bitfield id="ADC14ENC" description="ADC14 enable conversion" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="ADC14 disabled"/>
            <bitenum id="ENABLE" value="0x1" description="ADC14 enabled"/>
        </bitfield>
        <bitfield id="ADC14ON" description="ADC14 on" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="ADC14 off"/>
            <bitenum id="ON" value="0x1" description="ADC14 on. ADC core is ready to power up when a valid conversion is triggered."/>
        </bitfield>
        <bitfield id="ADC14MSC" description="ADC14 multiple sample and conversion" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="SINGLE" value="0x0" description="The sampling timer requires a rising edge of the SHI signal to trigger each sample-and-convert"/>
            <bitenum id="MULTIPLE" value="0x1" description="The first rising edge of the SHI signal triggers the sampling timer, but further sample-and-conversions are performed automatically as soon as the prior conversion is completed"/>
        </bitfield>
        <bitfield id="ADC14SHT0" description="ADC14 sample-and-hold time" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="4" value="0x0" description="4"/>
            <bitenum id="8" value="0x1" description="8"/>
            <bitenum id="16" value="0x2" description="16"/>
            <bitenum id="32" value="0x3" description="32"/>
            <bitenum id="64" value="0x4" description="64"/>
            <bitenum id="96" value="0x5" description="96"/>
            <bitenum id="128" value="0x6" description="128"/>
            <bitenum id="192" value="0x7" description="192"/>
        </bitfield>
        <bitfield id="ADC14SHT1" description="ADC14 sample-and-hold time" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="4" value="0x0" description="4"/>
            <bitenum id="8" value="0x1" description="8"/>
            <bitenum id="16" value="0x2" description="16"/>
            <bitenum id="32" value="0x3" description="32"/>
            <bitenum id="64" value="0x4" description="64"/>
            <bitenum id="96" value="0x5" description="96"/>
            <bitenum id="128" value="0x6" description="128"/>
            <bitenum id="192" value="0x7" description="192"/>
        </bitfield>
        <bitfield id="ADC14BUSY" description="ADC14 busy" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="IDLE" value="0x0" description="No operation is active"/>
            <bitenum id="BUSY" value="0x1" description="A sequence, sample, or conversion is active"/>
        </bitfield>
        <bitfield id="ADC14CONSEQ" description="ADC14 conversion sequence mode select" begin="18" end="17" width="2" rwaccess="R/W">
            <bitenum id="ADC14CONSEQ_0" value="0x0" description="Single-channel, single-conversion"/>
            <bitenum id="ADC14CONSEQ_1" value="0x1" description="Sequence-of-channels"/>
            <bitenum id="ADC14CONSEQ_2" value="0x2" description="Repeat-single-channel"/>
            <bitenum id="ADC14CONSEQ_3" value="0x3" description="Repeat-sequence-of-channels"/>
        </bitfield>
        <bitfield id="ADC14SSEL" description="ADC14 clock source select" begin="21" end="19" width="3" rwaccess="R/W">
            <bitenum id="MODCLK" value="0x0" description="MODCLK"/>
            <bitenum id="SYSCLK" value="0x1" description="SYSCLK"/>
            <bitenum id="ACLK" value="0x2" description="ACLK"/>
            <bitenum id="MCLK" value="0x3" description="MCLK"/>
            <bitenum id="SMCLK" value="0x4" description="SMCLK"/>
            <bitenum id="HSMCLK" value="0x5" description="HSMCLK"/>
        </bitfield>
        <bitfield id="ADC14DIV" description="ADC14 clock divider" begin="24" end="22" width="3" rwaccess="R/W">
            <bitenum id="1" value="0x0" description="/1"/>
            <bitenum id="2" value="0x1" description="/2"/>
            <bitenum id="3" value="0x2" description="/3"/>
            <bitenum id="4" value="0x3" description="/4"/>
            <bitenum id="5" value="0x4" description="/5"/>
            <bitenum id="6" value="0x5" description="/6"/>
            <bitenum id="7" value="0x6" description="/7"/>
            <bitenum id="8" value="0x7" description="/8"/>
        </bitfield>
        <bitfield id="ADC14ISSH" description="ADC14 invert signal sample-and-hold" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="The sample-input signal is not inverted"/>
            <bitenum id="ON" value="0x1" description="The sample-input signal is inverted"/>
        </bitfield>
        <bitfield id="ADC14SHP" description="ADC14 sample-and-hold pulse-mode select" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="ADC14SHP_0" value="0x0" description="SAMPCON signal is sourced from the sample-input signal"/>
            <bitenum id="ADC14SHP_1" value="0x1" description="SAMPCON signal is sourced from the sampling timer"/>
        </bitfield>
        <bitfield id="ADC14SHS" description="ADC14 sample-and-hold source select" begin="29" end="27" width="3" rwaccess="R/W">
            <bitenum id="ADC14SHS_0" value="0x0" description="ADC14SC bit"/>
            <bitenum id="ADC14SHS_1" value="0x1" description="See device-specific data sheet for source"/>
            <bitenum id="ADC14SHS_2" value="0x2" description="See device-specific data sheet for source"/>
            <bitenum id="ADC14SHS_3" value="0x3" description="See device-specific data sheet for source"/>
            <bitenum id="ADC14SHS_4" value="0x4" description="See device-specific data sheet for source"/>
            <bitenum id="ADC14SHS_5" value="0x5" description="See device-specific data sheet for source"/>
            <bitenum id="ADC14SHS_6" value="0x6" description="See device-specific data sheet for source"/>
            <bitenum id="ADC14SHS_7" value="0x7" description="See device-specific data sheet for source"/>
        </bitfield>
        <bitfield id="ADC14PDIV" description="ADC14 predivider" begin="31" end="30" width="2" rwaccess="R/W">
            <bitenum id="1" value="0x0" description="Predivide by 1"/>
            <bitenum id="4" value="0x1" description="Predivide by 4"/>
            <bitenum id="32" value="0x2" description="Predivide by 32"/>
            <bitenum id="64" value="0x3" description="Predivide by 64"/>
        </bitfield>
    </register>
    <register id="ADC14CTL1" width="32" offset="0x4" internal="0" description="Control 1 Register">
        <bitfield id="ADC14PWRMD" description="ADC14 power modes" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="ADC14PWRMD_0" value="0x0" description="Regular power mode for use with any resolution setting. Sample rate can be up to 1 Msps."/>
            <bitenum id="ADC14PWRMD_2" value="0x2" description="Low-power mode for 12-bit, 10-bit, and 8-bit resolution settings. Sample rate must not exceed 200 ksps."/>
        </bitfield>
        <bitfield id="ADC14REFBURST" description="ADC14 reference buffer burst" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="ADC14REFBURST_0" value="0x0" description="ADC reference buffer on continuously"/>
            <bitenum id="ADC14REFBURST_1" value="0x1" description="ADC reference buffer on only during sample-and-conversion"/>
        </bitfield>
        <bitfield id="ADC14DF" description="ADC14 data read-back format" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="UNSIGNED" value="0x0" description="Binary unsigned. Theoretically, for ADC14DIF = 0 and 14-bit mode, the analog input voltage - V(REF) results in 0000h, and the analog input voltage + V(REF) results in 3FFFh"/>
            <bitenum id="SIGNED" value="0x1" description="Signed binary (2s complement), left aligned. Theoretically, for ADC14DIF = 0 and 14-bit mode, the analog input voltage - V(REF) results in 8000h, and the analog input voltage + V(REF) results in 7FFCh"/>
        </bitfield>
        <bitfield id="ADC14RES" description="ADC14 resolution" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="8BIT" value="0x0" description="8 bit (9 clock cycle conversion time)"/>
            <bitenum id="10BIT" value="0x1" description="10 bit (11 clock cycle conversion time)"/>
            <bitenum id="12BIT" value="0x2" description="12 bit (14 clock cycle conversion time)"/>
            <bitenum id="14BIT" value="0x3" description="14 bit (16 clock cycle conversion time)"/>
        </bitfield>
        <bitfield id="ADC14CSTARTADD" description="ADC14 conversion start address" begin="20" end="16" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="ADC14BATMAP" description="Controls 1/2 AVCC ADC input channel selection" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="ADC internal 1/2 x AVCC channel is not selected for ADC"/>
            <bitenum id="ON" value="0x1" description="ADC internal 1/2 x AVCC channel is selected for ADC input channel MAX"/>
        </bitfield>
        <bitfield id="ADC14TCMAP" description="Controls temperature sensor ADC input channel selection" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="ADC internal temperature sensor channel is not selected for ADC"/>
            <bitenum id="ON" value="0x1" description="ADC internal temperature sensor channel is selected for ADC input channel MAX-1"/>
        </bitfield>
        <bitfield id="ADC14CH0MAP" description="Controls internal channel 0 selection to ADC input channel MAX-2" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="ADC input channel internal 0 is not selected"/>
            <bitenum id="ON" value="0x1" description="ADC input channel internal 0 is selected for ADC input channel MAX-2"/>
        </bitfield>
        <bitfield id="ADC14CH1MAP" description="Controls internal channel 1 selection to ADC input channel MAX-3" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="ADC input channel internal 1 is not selected"/>
            <bitenum id="ON" value="0x1" description="ADC input channel internal 1 is selected for ADC input channel MAX-3"/>
        </bitfield>
        <bitfield id="ADC14CH2MAP" description="Controls internal channel 2 selection to ADC input channel MAX-4" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="ADC input channel internal 2 is not selected"/>
            <bitenum id="ON" value="0x1" description="ADC input channel internal 2 is selected for ADC input channel MAX-4"/>
        </bitfield>
        <bitfield id="ADC14CH3MAP" description="Controls internal channel 3 selection to ADC input channel MAX-5" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="ADC input channel internal 3 is not selected"/>
            <bitenum id="ON" value="0x1" description="ADC input channel internal 3 is selected for ADC input channel MAX-5"/>
        </bitfield>
    </register>
    <register id="ADC14LO0" width="32" offset="0x8" internal="0" description="Window Comparator Low Threshold 0 Register">
        <bitfield id="ADC14LO0" description="Low threshold 0" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14HI0" width="32" offset="0xC" internal="0" description="Window Comparator High Threshold 0 Register">
        <bitfield id="ADC14HI0" description="High threshold 0" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14LO1" width="32" offset="0x10" internal="0" description="Window Comparator Low Threshold 1 Register">
        <bitfield id="ADC14LO1" description="Low threshold 1" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14HI1" width="32" offset="0x14" internal="0" description="Window Comparator High Threshold 1 Register">
        <bitfield id="ADC14HI1" description="High threshold 1" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MCTL0" width="32" offset="0x18" internal="0" description="Conversion Memory Control Register">
        <bitfield id="ADC14INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="ADC14INCH_0" value="0x0" description="If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC14INCH_1" value="0x1" description="If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC14INCH_2" value="0x2" description="If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC14INCH_3" value="0x3" description="If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC14INCH_4" value="0x4" description="If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC14INCH_5" value="0x5" description="If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC14INCH_6" value="0x6" description="If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC14INCH_7" value="0x7" description="If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC14INCH_8" value="0x8" description="If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC14INCH_9" value="0x9" description="If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC14INCH_10" value="0xA" description="If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC14INCH_11" value="0xB" description="If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC14INCH_12" value="0xC" description="If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC14INCH_13" value="0xD" description="If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC14INCH_14" value="0xE" description="If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC14INCH_15" value="0xF" description="If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC14INCH_16" value="0x10" description="If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC14INCH_17" value="0x11" description="If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC14INCH_18" value="0x12" description="If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC14INCH_19" value="0x13" description="If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC14INCH_20" value="0x14" description="If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC14INCH_21" value="0x15" description="If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC14INCH_22" value="0x16" description="If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC14INCH_23" value="0x17" description="If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC14INCH_24" value="0x18" description="If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC14INCH_25" value="0x19" description="If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC14INCH_26" value="0x1A" description="If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC14INCH_27" value="0x1B" description="If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC14INCH_28" value="0x1C" description="If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC14INCH_29" value="0x1D" description="If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC14INCH_30" value="0x1E" description="If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/>
            <bitenum id="ADC14INCH_31" value="0x1F" description="If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/>
        </bitfield>
        <bitfield id="ADC14EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC14EOS_0" value="0x0" description="Not end of sequence"/>
            <bitenum id="ADC14EOS_1" value="0x1" description="End of sequence"/>
        </bitfield>
        <bitfield id="ADC14VRSEL" description="Selects combinations of V(R+) and V(R-) sources" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="ADC14VRSEL_0" value="0x0" description="V(R+) = AVCC, V(R-) = AVSS"/>
            <bitenum id="ADC14VRSEL_1" value="0x1" description="V(R+) = VREF buffered, V(R-) = AVSS"/>
            <bitenum id="ADC14VRSEL_14" value="0xE" description="V(R+) = VeREF+, V(R-) = VeREF-"/>
            <bitenum id="ADC14VRSEL_15" value="0xF" description="V(R+) = VeREF+ buffered, V(R-) = VeREF"/>
        </bitfield>
        <bitfield id="ADC14DIF" description="Differential mode" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC14DIF_0" value="0x0" description="Single-ended mode enabled"/>
            <bitenum id="ADC14DIF_1" value="0x1" description="Differential mode enabled"/>
        </bitfield>
        <bitfield id="ADC14WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Comparator window disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Comparator window enabled"/>
        </bitfield>
        <bitfield id="ADC14WINCTH" description="Window comparator threshold register selection" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="TH0" value="0x0" description="Use window comparator thresholds 0, ADC14LO0 and ADC14HI0"/>
            <bitenum id="TH1" value="0x1" description="Use window comparator thresholds 1, ADC14LO1 and ADC14HI1"/>
        </bitfield>
    </register>
