Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/ADC14_356.0.xml
    <register id="ADC14MCTL29" width="32" offset="0x8C" internal="0" description="Conversion Memory Control Register">
        <bitfield id="ADC14INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="ADC14INCH_0" value="0x0" description="If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC14INCH_1" value="0x1" description="If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC14INCH_2" value="0x2" description="If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC14INCH_3" value="0x3" description="If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC14INCH_4" value="0x4" description="If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC14INCH_5" value="0x5" description="If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC14INCH_6" value="0x6" description="If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC14INCH_7" value="0x7" description="If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC14INCH_8" value="0x8" description="If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC14INCH_9" value="0x9" description="If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC14INCH_10" value="0xA" description="If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC14INCH_11" value="0xB" description="If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC14INCH_12" value="0xC" description="If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC14INCH_13" value="0xD" description="If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC14INCH_14" value="0xE" description="If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC14INCH_15" value="0xF" description="If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC14INCH_16" value="0x10" description="If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC14INCH_17" value="0x11" description="If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC14INCH_18" value="0x12" description="If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC14INCH_19" value="0x13" description="If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC14INCH_20" value="0x14" description="If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC14INCH_21" value="0x15" description="If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC14INCH_22" value="0x16" description="If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC14INCH_23" value="0x17" description="If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC14INCH_24" value="0x18" description="If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC14INCH_25" value="0x19" description="If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC14INCH_26" value="0x1A" description="If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC14INCH_27" value="0x1B" description="If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC14INCH_28" value="0x1C" description="If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC14INCH_29" value="0x1D" description="If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC14INCH_30" value="0x1E" description="If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/>
            <bitenum id="ADC14INCH_31" value="0x1F" description="If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/>
        </bitfield>
        <bitfield id="ADC14EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC14EOS_0" value="0x0" description="Not end of sequence"/>
            <bitenum id="ADC14EOS_1" value="0x1" description="End of sequence"/>
        </bitfield>
        <bitfield id="ADC14VRSEL" description="Selects combinations of V(R+) and V(R-) sources" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="ADC14VRSEL_0" value="0x0" description="V(R+) = AVCC, V(R-) = AVSS"/>
            <bitenum id="ADC14VRSEL_1" value="0x1" description="V(R+) = VREF buffered, V(R-) = AVSS"/>
            <bitenum id="ADC14VRSEL_14" value="0xE" description="V(R+) = VeREF+, V(R-) = VeREF-"/>
            <bitenum id="ADC14VRSEL_15" value="0xF" description="V(R+) = VeREF+ buffered, V(R-) = VeREF"/>
        </bitfield>
        <bitfield id="ADC14DIF" description="Differential mode" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC14DIF_0" value="0x0" description="Single-ended mode enabled"/>
            <bitenum id="ADC14DIF_1" value="0x1" description="Differential mode enabled"/>
        </bitfield>
        <bitfield id="ADC14WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Comparator window disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Comparator window enabled"/>
        </bitfield>
        <bitfield id="ADC14WINCTH" description="Window comparator threshold register selection" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="TH0" value="0x0" description="Use window comparator thresholds 0, ADC14LO0 and ADC14HI0"/>
            <bitenum id="TH1" value="0x1" description="Use window comparator thresholds 1, ADC14LO1 and ADC14HI1"/>
        </bitfield>
    </register>
    <register id="ADC14MCTL30" width="32" offset="0x90" internal="0" description="Conversion Memory Control Register">
        <bitfield id="ADC14INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="ADC14INCH_0" value="0x0" description="If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC14INCH_1" value="0x1" description="If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC14INCH_2" value="0x2" description="If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC14INCH_3" value="0x3" description="If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC14INCH_4" value="0x4" description="If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC14INCH_5" value="0x5" description="If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC14INCH_6" value="0x6" description="If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC14INCH_7" value="0x7" description="If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC14INCH_8" value="0x8" description="If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC14INCH_9" value="0x9" description="If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC14INCH_10" value="0xA" description="If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC14INCH_11" value="0xB" description="If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC14INCH_12" value="0xC" description="If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC14INCH_13" value="0xD" description="If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC14INCH_14" value="0xE" description="If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC14INCH_15" value="0xF" description="If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC14INCH_16" value="0x10" description="If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC14INCH_17" value="0x11" description="If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC14INCH_18" value="0x12" description="If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC14INCH_19" value="0x13" description="If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC14INCH_20" value="0x14" description="If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC14INCH_21" value="0x15" description="If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC14INCH_22" value="0x16" description="If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC14INCH_23" value="0x17" description="If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC14INCH_24" value="0x18" description="If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC14INCH_25" value="0x19" description="If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC14INCH_26" value="0x1A" description="If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC14INCH_27" value="0x1B" description="If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC14INCH_28" value="0x1C" description="If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC14INCH_29" value="0x1D" description="If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC14INCH_30" value="0x1E" description="If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/>
            <bitenum id="ADC14INCH_31" value="0x1F" description="If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/>
        </bitfield>
        <bitfield id="ADC14EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC14EOS_0" value="0x0" description="Not end of sequence"/>
            <bitenum id="ADC14EOS_1" value="0x1" description="End of sequence"/>
        </bitfield>
        <bitfield id="ADC14VRSEL" description="Selects combinations of V(R+) and V(R-) sources" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="ADC14VRSEL_0" value="0x0" description="V(R+) = AVCC, V(R-) = AVSS"/>
            <bitenum id="ADC14VRSEL_1" value="0x1" description="V(R+) = VREF buffered, V(R-) = AVSS"/>
            <bitenum id="ADC14VRSEL_14" value="0xE" description="V(R+) = VeREF+, V(R-) = VeREF-"/>
            <bitenum id="ADC14VRSEL_15" value="0xF" description="V(R+) = VeREF+ buffered, V(R-) = VeREF"/>
        </bitfield>
        <bitfield id="ADC14DIF" description="Differential mode" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC14DIF_0" value="0x0" description="Single-ended mode enabled"/>
            <bitenum id="ADC14DIF_1" value="0x1" description="Differential mode enabled"/>
        </bitfield>
        <bitfield id="ADC14WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Comparator window disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Comparator window enabled"/>
        </bitfield>
        <bitfield id="ADC14WINCTH" description="Window comparator threshold register selection" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="TH0" value="0x0" description="Use window comparator thresholds 0, ADC14LO0 and ADC14HI0"/>
            <bitenum id="TH1" value="0x1" description="Use window comparator thresholds 1, ADC14LO1 and ADC14HI1"/>
        </bitfield>
    </register>
    <register id="ADC14MCTL31" width="32" offset="0x94" internal="0" description="Conversion Memory Control Register">
        <bitfield id="ADC14INCH" description="Input channel select" begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="ADC14INCH_0" value="0x0" description="If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC14INCH_1" value="0x1" description="If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1"/>
            <bitenum id="ADC14INCH_2" value="0x2" description="If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC14INCH_3" value="0x3" description="If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3"/>
            <bitenum id="ADC14INCH_4" value="0x4" description="If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC14INCH_5" value="0x5" description="If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5"/>
            <bitenum id="ADC14INCH_6" value="0x6" description="If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC14INCH_7" value="0x7" description="If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7"/>
            <bitenum id="ADC14INCH_8" value="0x8" description="If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC14INCH_9" value="0x9" description="If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9"/>
            <bitenum id="ADC14INCH_10" value="0xA" description="If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC14INCH_11" value="0xB" description="If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11"/>
            <bitenum id="ADC14INCH_12" value="0xC" description="If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC14INCH_13" value="0xD" description="If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13"/>
            <bitenum id="ADC14INCH_14" value="0xE" description="If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC14INCH_15" value="0xF" description="If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15"/>
            <bitenum id="ADC14INCH_16" value="0x10" description="If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC14INCH_17" value="0x11" description="If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17"/>
            <bitenum id="ADC14INCH_18" value="0x12" description="If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC14INCH_19" value="0x13" description="If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19"/>
            <bitenum id="ADC14INCH_20" value="0x14" description="If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC14INCH_21" value="0x15" description="If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21"/>
            <bitenum id="ADC14INCH_22" value="0x16" description="If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC14INCH_23" value="0x17" description="If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23"/>
            <bitenum id="ADC14INCH_24" value="0x18" description="If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC14INCH_25" value="0x19" description="If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25"/>
            <bitenum id="ADC14INCH_26" value="0x1A" description="If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC14INCH_27" value="0x1B" description="If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27"/>
            <bitenum id="ADC14INCH_28" value="0x1C" description="If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC14INCH_29" value="0x1D" description="If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29"/>
            <bitenum id="ADC14INCH_30" value="0x1E" description="If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/>
            <bitenum id="ADC14INCH_31" value="0x1F" description="If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31"/>
        </bitfield>
        <bitfield id="ADC14EOS" description="End of sequence" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="ADC14EOS_0" value="0x0" description="Not end of sequence"/>
            <bitenum id="ADC14EOS_1" value="0x1" description="End of sequence"/>
        </bitfield>
        <bitfield id="ADC14VRSEL" description="Selects combinations of V(R+) and V(R-) sources" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="ADC14VRSEL_0" value="0x0" description="V(R+) = AVCC, V(R-) = AVSS"/>
            <bitenum id="ADC14VRSEL_1" value="0x1" description="V(R+) = VREF buffered, V(R-) = AVSS"/>
            <bitenum id="ADC14VRSEL_14" value="0xE" description="V(R+) = VeREF+, V(R-) = VeREF-"/>
            <bitenum id="ADC14VRSEL_15" value="0xF" description="V(R+) = VeREF+ buffered, V(R-) = VeREF"/>
        </bitfield>
        <bitfield id="ADC14DIF" description="Differential mode" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ADC14DIF_0" value="0x0" description="Single-ended mode enabled"/>
            <bitenum id="ADC14DIF_1" value="0x1" description="Differential mode enabled"/>
        </bitfield>
        <bitfield id="ADC14WINC" description="Comparator window enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Comparator window disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Comparator window enabled"/>
        </bitfield>
        <bitfield id="ADC14WINCTH" description="Window comparator threshold register selection" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="TH0" value="0x0" description="Use window comparator thresholds 0, ADC14LO0 and ADC14HI0"/>
            <bitenum id="TH1" value="0x1" description="Use window comparator thresholds 1, ADC14LO1 and ADC14HI1"/>
        </bitfield>
    </register>
    <register id="ADC14MEM0" width="32" offset="0x98" internal="0" description="Conversion Memory Register">
        <bitfield id="Co0versio0_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM1" width="32" offset="0x9C" internal="0" description="Conversion Memory Register">
        <bitfield id="Co1versio1_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM2" width="32" offset="0xA0" internal="0" description="Conversion Memory Register">
        <bitfield id="Co2versio2_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
