Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/ADC14_356.0.xml
    <register id="ADC14MEM3" width="32" offset="0xA4" internal="0" description="Conversion Memory Register">
        <bitfield id="Co3versio3_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM4" width="32" offset="0xA8" internal="0" description="Conversion Memory Register">
        <bitfield id="Co4versio4_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM5" width="32" offset="0xAC" internal="0" description="Conversion Memory Register">
        <bitfield id="Co5versio5_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM6" width="32" offset="0xB0" internal="0" description="Conversion Memory Register">
        <bitfield id="Co6versio6_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM7" width="32" offset="0xB4" internal="0" description="Conversion Memory Register">
        <bitfield id="Co7versio7_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM8" width="32" offset="0xB8" internal="0" description="Conversion Memory Register">
        <bitfield id="Co8versio8_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM9" width="32" offset="0xBC" internal="0" description="Conversion Memory Register">
        <bitfield id="Co9versio9_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM10" width="32" offset="0xC0" internal="0" description="Conversion Memory Register">
        <bitfield id="Co10versio10_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM11" width="32" offset="0xC4" internal="0" description="Conversion Memory Register">
        <bitfield id="Co11versio11_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM12" width="32" offset="0xC8" internal="0" description="Conversion Memory Register">
        <bitfield id="Co12versio12_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM13" width="32" offset="0xCC" internal="0" description="Conversion Memory Register">
        <bitfield id="Co13versio13_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM14" width="32" offset="0xD0" internal="0" description="Conversion Memory Register">
        <bitfield id="Co14versio14_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM15" width="32" offset="0xD4" internal="0" description="Conversion Memory Register">
        <bitfield id="Co15versio15_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM16" width="32" offset="0xD8" internal="0" description="Conversion Memory Register">
        <bitfield id="Co16versio16_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM17" width="32" offset="0xDC" internal="0" description="Conversion Memory Register">
        <bitfield id="Co17versio17_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM18" width="32" offset="0xE0" internal="0" description="Conversion Memory Register">
        <bitfield id="Co18versio18_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM19" width="32" offset="0xE4" internal="0" description="Conversion Memory Register">
        <bitfield id="Co19versio19_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM20" width="32" offset="0xE8" internal="0" description="Conversion Memory Register">
        <bitfield id="Co20versio20_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM21" width="32" offset="0xEC" internal="0" description="Conversion Memory Register">
        <bitfield id="Co21versio21_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM22" width="32" offset="0xF0" internal="0" description="Conversion Memory Register">
        <bitfield id="Co22versio22_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM23" width="32" offset="0xF4" internal="0" description="Conversion Memory Register">
        <bitfield id="Co23versio23_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM24" width="32" offset="0xF8" internal="0" description="Conversion Memory Register">
        <bitfield id="Co24versio24_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="ADC14MEM25" width="32" offset="0xFC" internal="0" description="Conversion Memory Register">
        <bitfield id="Co25versio25_Results" description="Conversion Result" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
