Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/ADC14_356.0.xml
    <register id="ADC14IFGR1" width="32" offset="0x148" internal="0" description="Interrupt Flag 1 Register">
        <bitfield id="ADC14INIFG" description="Interrupt flag for ADC14MEMx within comparator window" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="ADC14INIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC14INIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC14LOIFG" description="Interrupt flag for ADC14MEMx below comparator window" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="ADC14LOIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC14LOIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC14HIIFG" description="Interrupt flag for ADC14MEMx above comparator window" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="ADC14HIIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC14HIIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC14OVIFG" description="ADC14MEMx overflow interrupt flag" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="ADC14OVIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC14OVIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC14TOVIFG" description="ADC14 conversion time overflow interrupt flag" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="ADC14TOVIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC14TOVIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="ADC14RDYIFG" description="ADC14 local buffered reference ready interrupt flag" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="ADC14RDYIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="ADC14RDYIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
    </register>
    <register id="ADC14CLRIFGR0" width="32" offset="0x14C" internal="0" description="Clear Interrupt Flag 0 Register">
        <bitfield id="CLRADC14IFG0" description="clear ADC14IFG0" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG0_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG1" description="clear ADC14IFG1" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG1_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG2" description="clear ADC14IFG2" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG2_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG3" description="clear ADC14IFG3" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG3_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG4" description="clear ADC14IFG4" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG4_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG5" description="clear ADC14IFG5" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG5_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG6" description="clear ADC14IFG6" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG6_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG7" description="clear ADC14IFG7" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG7_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG8" description="clear ADC14IFG8" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG8_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG9" description="clear ADC14IFG9" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG9_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG10" description="clear ADC14IFG10" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG10_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG11" description="clear ADC14IFG11" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG11_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG12" description="clear ADC14IFG12" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG12_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG13" description="clear ADC14IFG13" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG13_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG14" description="clear ADC14IFG14" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG14_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG15" description="clear ADC14IFG15" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG15_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG16" description="clear ADC14IFG16" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG16_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG17" description="clear ADC14IFG17" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG17_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG18" description="clear ADC14IFG18" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG18_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG19" description="clear ADC14IFG19" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG19_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG20" description="clear ADC14IFG20" begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG20_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG21" description="clear ADC14IFG21" begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG21_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG22" description="clear ADC14IFG22" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG22_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG23" description="clear ADC14IFG23" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG23_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG24" description="clear ADC14IFG24" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG24_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG25" description="clear ADC14IFG25" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG25_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG26" description="clear ADC14IFG26" begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG26_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG27" description="clear ADC14IFG27" begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG27_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG28" description="clear ADC14IFG28" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG28_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG29" description="clear ADC14IFG29" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG29_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG30" description="clear ADC14IFG30" begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG30_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14IFG31" description="clear ADC14IFG31" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14IFG31_0" value="0x0" description="no effect"/>
            <bitenum id="CLEAR" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
    </register>
    <register id="ADC14CLRIFGR1" width="32" offset="0x150" internal="0" description="Clear Interrupt Flag 1 Register">
        <bitfield id="CLRADC14INIFG" description="clear ADC14INIFG" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14INIFG_0" value="0x0" description="no effect"/>
            <bitenum id="CLRADC14INIFG_1" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14LOIFG" description="clear ADC14LOIFG" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14LOIFG_0" value="0x0" description="no effect"/>
            <bitenum id="CLRADC14LOIFG_1" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14HIIFG" description="clear ADC14HIIFG" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14HIIFG_0" value="0x0" description="no effect"/>
            <bitenum id="CLRADC14HIIFG_1" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14OVIFG" description="clear ADC14OVIFG" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14OVIFG_0" value="0x0" description="no effect"/>
            <bitenum id="CLRADC14OVIFG_1" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14TOVIFG" description="clear ADC14TOVIFG" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14TOVIFG_0" value="0x0" description="no effect"/>
            <bitenum id="CLRADC14TOVIFG_1" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLRADC14RDYIFG" description="clear ADC14RDYIFG" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="CLRADC14RDYIFG_0" value="0x0" description="no effect"/>
            <bitenum id="CLRADC14RDYIFG_1" value="0x1" description="clear pending interrupt flag"/>
        </bitfield>
    </register>
    <register id="ADC14IV" width="32" offset="0x154" internal="0" description="Interrupt Vector Register">
        <bitfield id="ADC14IV" description="ADC14 interrupt vector value" begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="NONE" value="0x0" description="No interrupt pending"/>
            <bitenum id="OVIFG" value="0x2" description="Interrupt Source: ADC14MEMx overflow; Interrupt Flag: ADC14OVIFG; Interrupt Priority: Highest"/>
            <bitenum id="TOVIFG" value="0x4" description="Interrupt Source: Conversion time overflow; Interrupt Flag: ADC14TOVIFG"/>
            <bitenum id="HIIFG" value="0x6" description="Interrupt Source: ADC14 window high interrupt flag; Interrupt Flag: ADC14HIIFG"/>
            <bitenum id="LOIFG" value="0x8" description="Interrupt Source: ADC14 window low interrupt flag; Interrupt Flag: ADC14LOIFG"/>
            <bitenum id="INIFG" value="0xA" description="Interrupt Source: ADC14 in-window interrupt flag; Interrupt Flag: ADC14INIFG"/>
            <bitenum id="IFG0" value="0xC" description="Interrupt Source: ADC14MEM0 interrupt flag; Interrupt Flag: ADC14IFG0"/>
            <bitenum id="IFG1" value="0xE" description="Interrupt Source: ADC14MEM1 interrupt flag; Interrupt Flag: ADC14IFG1"/>
            <bitenum id="IFG2" value="0x10" description="Interrupt Source: ADC14MEM2 interrupt flag; Interrupt Flag: ADC14IFG2"/>
            <bitenum id="IFG3" value="0x12" description="Interrupt Source: ADC14MEM3 interrupt flag; Interrupt Flag: ADC14IFG3"/>
            <bitenum id="IFG4" value="0x14" description="Interrupt Source: ADC14MEM4 interrupt flag; Interrupt Flag: ADC14IFG4"/>
            <bitenum id="IFG5" value="0x16" description="Interrupt Source: ADC14MEM5 interrupt flag; Interrupt Flag: ADC14IFG5"/>
            <bitenum id="IFG6" value="0x18" description="Interrupt Source: ADC14MEM6 interrupt flag; Interrupt Flag: ADC14IFG6"/>
            <bitenum id="IFG7" value="0x1A" description="Interrupt Source: ADC14MEM7 interrupt flag; Interrupt Flag: ADC14IFG7"/>
            <bitenum id="IFG8" value="0x1C" description="Interrupt Source: ADC14MEM8 interrupt flag; Interrupt Flag: ADC14IFG8"/>
            <bitenum id="IFG9" value="0x1E" description="Interrupt Source: ADC14MEM9 interrupt flag; Interrupt Flag: ADC14IFG9"/>
            <bitenum id="IFG10" value="0x20" description="Interrupt Source: ADC14MEM10 interrupt flag; Interrupt Flag: ADC14IFG10"/>
            <bitenum id="IFG11" value="0x22" description="Interrupt Source: ADC14MEM11 interrupt flag; Interrupt Flag: ADC14IFG11"/>
            <bitenum id="IFG12" value="0x24" description="Interrupt Source: ADC14MEM12 interrupt flag; Interrupt Flag: ADC14IFG12"/>
            <bitenum id="IFG13" value="0x26" description="Interrupt Source: ADC14MEM13 interrupt flag; Interrupt Flag: ADC14IFG13"/>
            <bitenum id="IFG14" value="0x28" description="Interrupt Source: ADC14MEM14 interrupt flag; Interrupt Flag: ADC14IFG14"/>
            <bitenum id="IFG15" value="0x2A" description="Interrupt Source: ADC14MEM15 interrupt flag; Interrupt Flag: ADC14IFG15"/>
            <bitenum id="IFG16" value="0x2C" description="Interrupt Source: ADC14MEM16 interrupt flag; Interrupt Flag: ADC14IFG16"/>
            <bitenum id="IFG17" value="0x2E" description="Interrupt Source: ADC14MEM17 interrupt flag; Interrupt Flag: ADC14IFG17"/>
            <bitenum id="IFG18" value="0x30" description="Interrupt Source: ADC14MEM18 interrupt flag; Interrupt Flag: ADC14IFG18"/>
            <bitenum id="IFG19" value="0x32" description="Interrupt Source: ADC14MEM19 interrupt flag; Interrupt Flag: ADC14IFG19"/>
            <bitenum id="IFG20" value="0x34" description="Interrupt Source: ADC14MEM20 interrupt flag; Interrupt Flag: ADC14IFG20"/>
            <bitenum id="IFG21" value="0x36" description="Interrupt Source: ADC14MEM22 interrupt flag; Interrupt Flag: ADC14IFG22"/>
            <bitenum id="IFG22" value="0x38" description="Interrupt Source: ADC14MEM22 interrupt flag; Interrupt Flag: ADC14IFG22"/>
            <bitenum id="IFG23" value="0x3A" description="Interrupt Source: ADC14MEM23 interrupt flag; Interrupt Flag: ADC14IFG23"/>
            <bitenum id="IFG24" value="0x3C" description="Interrupt Source: ADC14MEM24 interrupt flag; Interrupt Flag: ADC14IFG24"/>
            <bitenum id="IFG25" value="0x3E" description="Interrupt Source: ADC14MEM25 interrupt flag; Interrupt Flag: ADC14IFG25"/>
            <bitenum id="IFG26" value="0x40" description="Interrupt Source: ADC14MEM26 interrupt flag; Interrupt Flag: ADC14IFG26"/>
            <bitenum id="IFG27" value="0x42" description="Interrupt Source: ADC14MEM27 interrupt flag; Interrupt Flag: ADC14IFG27"/>
            <bitenum id="IFG28" value="0x44" description="Interrupt Source: ADC14MEM28 interrupt flag; Interrupt Flag: ADC14IFG28"/>
            <bitenum id="IFG29" value="0x46" description="Interrupt Source: ADC14MEM29 interrupt flag; Interrupt Flag: ADC14IFG29"/>
            <bitenum id="IFG30" value="0x48" description="Interrupt Source: ADC14MEM30 interrupt flag; Interrupt Flag: ADC14IFG30"/>
            <bitenum id="IFG31" value="0x4A" description="Interrupt Source: ADC14MEM31 interrupt flag; Interrupt Flag: ADC14IFG31"/>
            <bitenum id="RDYIFG" value="0x4C" description="Interrupt Source: ADC14RDYIFG interrupt flag; Interrupt Flag: ADC14RDYIFG; Interrupt Priority: Lowest"/>
        </bitfield>
    </register>
</module>
